{
  "The Craftsman": {
    "description": "Your hands make the impossible real. In a city where nothing's mass-produced, skill like yours is currency. Whether you're forging runes, modifying Neosapiens, or brewing alchemical compounds, you're one of the people who keeps Sidonia running.",
    "skillSpecializationOptions": [
      "Engineering: [Craft Type]",
      "Science: [Related Field]",
      "Craft: [Specific Discipline]"
    ],
    "resourceSynergyExamples": [
      "Property: Workshop Space",
      "Equipment: Tools and Equipment",
      "Contact: Material Suppliers",
      "Contact: Guild Memberships"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Master Artisan",
        "description": "Your name is synonymous with quality. You might be the city's premier runesmith, the only person trusted to modify Neosapiens, or the alchemist who supplies the Ministry's laboratories. Your work commands astronomical prices, your apprentices are sought after, and Ward Bosses compete for your services. You don't just make things - you set standards that others try to reach."
      },
      {
        "priority": "B",
        "title": "Guild Master",
        "description": "You run a successful workshop with multiple journeymen and apprentices. Your reputation extends beyond your Ward, and you handle commissions for wealthy clients and important institutions. You're a pillar of your craft's community, someone other artisans come to for advice or difficult problems. You make a very comfortable living from your skill."
      },
      {
        "priority": "C",
        "title": "Journeyman Craftsman",
        "description": "You've completed your apprenticeship and established your own practice. You have steady clients, a small workspace, and the credentials to work independently. You're competent and reliable - people know your name in your Ward and trust your work. You're not famous, but you're making a living doing what you're good at."
      },
      {
        "priority": "D",
        "title": "Apprentice",
        "description": "You're learning the trade under a master. You handle the simpler work, maintain tools, and slowly build skill through repetition and observation. You're not fully licensed yet, but you're developing real expertise. Your master's reputation protects you, but also means any mistakes reflect on them."
      },
      {
        "priority": "E",
        "title": "Hobbyist / Tinkerer",
        "description": "You've picked up basic skills - maybe from a family member, maybe self-taught from salvaged manuals. You can do simple repairs, make crude versions of common items, or jury-rig solutions to everyday problems. You're not a real craftsman in anyone's eyes, but in a city where nothing's mass-produced, even your rough work has value."
      }
    ]
  },
  "The Academic / Scholar": {
    "description": "Knowledge is power in Sidonia, and you're one of the people who controls it. Whether you're shaping policy from a university chair or teaching restless students, you understand that information and legitimacy are the real currencies of power.",
    "skillSpecializationOptions": [
      "Academics: [Field of Study]",
      "Science: [Related Field]",
      "Bureaucracy: Research"
    ],
    "resourceSynergyExamples": [
      "Contact: University Contacts",
      "Property: Library Access",
      "Income: Research Grants",
      "License: Academic Credentials"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Researcher",
        "description": "You're at the cutting edge. Maybe you run a department at Central District University, lead a privately funded institute, or head the Ministry of Information's research division. Your papers shape policy, your theories become doctrine, and your endorsement can make or break careers. You have access to archives most people don't know exist and funding that lets you chase questions that make other academics nervous."
      },
      {
        "priority": "B",
        "title": "Professor",
        "description": "You have tenure at a respected institution. You teach advanced courses, publish regularly, and your expertise is recognized city-wide. When the Ministry needs an expert opinion or a Ward Boss wants something legitimized with academic authority, your name comes up. You're not shaping the field, but you're a respected voice within it."
      },
      {
        "priority": "C",
        "title": "Faculty Administrator",
        "description": "You keep the academic machine running. Maybe you're a department head, a research coordinator, or manage a university library. You know where all the bodies are buried (sometimes literally, given Sidonian history), you control access to resources, and you understand how to navigate institutional politics. You're not famous, but you're essential."
      },
      {
        "priority": "D",
        "title": "Teacher",
        "description": "You teach the basics to students who mostly don't care. Maybe you're an adjunct professor, a secondary school instructor, or a private tutor for wealthy families. You know your subject well enough to explain it to others, and you're building toward something better - if you can survive the politics and the terrible pay."
      },
      {
        "priority": "E",
        "title": "Graduate Student / Research Assistant",
        "description": "You're still learning, but you've committed to the path. You assist with real research, teach undergraduate sections, and spend long nights in archives or laboratories. You're not paid enough, you're overworked, but you're building the foundation of expertise that might someday matter."
      }
    ]
  },
  "The Red Sentinel": {
    "description": "You wear the red. You're one of the psychic bulwarks that stands between order and chaos when the crowds turn into something worse. The helmet protects you from the ether's worst effects, but nothing protects you from what you see people become.",
    "skillSpecializationOptions": [
      "Hand-to-Hand: Subdual",
      "Melee: Baton",
      "Athletics: Endurance"
    ],
    "resourceSynergyExamples": [
      "Contact: Military Contacts",
      "Equipment: Riot Gear",
      "License: Red Sentinel Credentials",
      "Equipment: Specialized Equipment"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Command",
        "description": "You're a senior officer, possibly running operations for an entire district or commanding a specialized unit. You've seen dozens of riots, supernatural incursions, and situations that would break most people. You have the authority to deploy Sentinels across Wards, coordinate with Ward Bosses, and make calls that determine who lives and dies when things go sideways. Your helmet is a mark of authority - scarred, customized, earned through years of holding the line."
      },
      {
        "priority": "B",
        "title": "Officer",
        "description": "You lead squads into the chaos. When a riot breaks out or something supernatural needs containing, you're the one giving orders while standing in the thick of it. You've earned your rank through competence and survival, and your troops trust you to get them through alive. You coordinate with Command but you're still boots-on-ground when it matters."
      },
      {
        "priority": "C",
        "title": "Enlisted",
        "description": "You're a full Sentinel. You've been through multiple riots, faced down angry mobs and worse, and you've proven you can handle the psychic weight of it all. You know your squad, trust your helmet to keep the worst of the ether at bay, and you've earned the respect that comes with the uniform. This is your career, and you're good at it."
      },
      {
        "priority": "D",
        "title": "One and Done",
        "description": "You completed the training. You wore the helmet. You went into your first riot... and you took the out. Maybe the psychic pressure was too much, maybe seeing what a crowd can become broke something in you, or maybe you just realized you weren't built for it. It's not dishonorable - they give you the option for a reason - but you'll never be one of them. You can't call on the Sentinels for favors, and if you claim the title around real Sentinels, expect dismissive snorts at best."
      },
      {
        "priority": "E",
        "title": "Red Band",
        "description": "You're a civilian volunteer. When the Sentinels deploy, you wear the red armband so you don't catch a baton to the head. You help with logistics, crowd control at the edges, maybe first aid. You're useful, but you're not one of them. You've never worn the helmet, never felt the full weight of a riot's psychic pressure. In Central, wearing the band when Sentinels aren't around is just embarrassing. In the outer districts, it's a good way to get beaten bloody."
      }
    ]
  },
  "The Criminal Element": {
    "description": "Maybe you looked at all that and said, 'to hell with it.' Smart move. There's more honesty on the wrong side of the law anyway. But don't think for a second it's any less complicated.",
    "skillSpecializationOptions": [
      "Social: Intimidation",
      "Melee: Knives",
      "Larceny: Stealth"
    ],
    "resourceSynergyExamples": [
      "Contact: Fence",
      "Property: Stash House",
      "Contact: Underworld Contacts",
      "Equipment: Black Market Gear"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "The Banu / Syndicate Boss",
        "description": "You're at the top. Either you control a ward's criminal operations through territory and loyalty (Banu), or you manage a Syndicate's network, controlling supply lines and resource distribution across multiple territories. You don't answer to anyone except maybe the very top of the food chain."
      },
      {
        "priority": "B",
        "title": "The Syndicate Enforcer",
        "description": "These guys are a different beast. They don't care about turf; they care about product. Drugs, weapons, information... they control the supply lines. A Syndicate Enforcer isn't loyal to a neighborhood; they're loyal to the network. They're ghosts, and they're everywhere. More professional than the Banu's thugs, and a hell of a lot scarier."
      },
      {
        "priority": "C",
        "title": "The Fixer",
        "description": "A Fixer is an independent contractor in the business of making problems go away. They're the middlemen, the brokers, the ones who know everybody. Their power is their neutrality... or at least, the illusion of it. Everyone knows they have their favorite patrons, but they're useful enough that most people are willing to pretend they don't."
      },
      {
        "priority": "D",
        "title": "The Bully Boy",
        "description": "You're freelance muscle trying to make your name. Maybe you were a standout in your old gang, maybe you're just ambitious and skilled. You take contract work from whoever's paying - protection, collections, intimidation. You're building a reputation so you can move up to something more permanent. You're not tied to one crew, and that makes you both valuable and vulnerable."
      },
      {
        "priority": "E",
        "title": "The Street Soldier",
        "description": "You're a member of a neighborhood gang, maybe a former gaki who aged up. You handle collections, watch corners, and back up your crew in fights. You know your few blocks like the back of your hand, and you've got brothers who'll bleed with you - but you're still taking orders from above."
      }
    ]
  },
  "The Entertainer": {
    "description": "You think this city's all grit and shadows? Kid, people are desperate for a distraction, and if you're the one selling it, that's a special kind of power. But fame in Sidonia is a tricky beast. Depending on how big your stage is, you're either a god, a local hero, or just another voice in the crowd.",
    "skillSpecializationOptions": [
      "Social: Persuasion",
      "Alertness: Detect Lie",
      "Social: Performance"
    ],
    "resourceSynergyExamples": [
      "Contact: Talent Agent",
      "Property: Performance Venue",
      "License: Artistic License",
      "Equipment: Promotional Materials"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Icon / Movie Star",
        "description": "This is a new kind of power, something that didn't exist a generation ago. Thanks to the film reels, your face is known from the Southern slums to the Northern spires. You're an Icon, like Dita was in her prime. You're a shared dream in a city of nightmares. But that fame is a leash. The Ministry of Information watches every frame you shoot, and you only exist because you've learned not to bite the hand that allows you to feed. You're not just an actor; you're high-value, city-wide propaganda."
      },
      {
        "priority": "B",
        "title": "District Legend",
        "description": "You're not on the silver screen, but in your District, you're a household name. Maybe you're the charismatic leader of a rebel faction in the West, a feared Banu in the South, or a celebrated philosopher in the North. You're the local legend everyone tells stories about. Your power is immense, but it stops hard at the district line. You're a king in your own little kingdom, but step outside, and you're just another face in the crowd."
      },
      {
        "priority": "C",
        "title": "Ward Performer",
        "description": "You work the Wards. You're the singer whose voice makes jaded Sentinels weep, the stage actor in the rundown theater, the musician in smoky clubs. You're not famous - you're known. People in your Ward know your name, buy you drinks, and feel connected to you."
      },
      {
        "priority": "D",
        "title": "Neighborhood Talent",
        "description": "Your stage is hyperlocal. Maybe you're the undefeated pit fighter, the artist who designs clothes everyone wants, or the genius who brews the best moonshine in five blocks. You're a big fish in a very small, murky pond."
      },
      {
        "priority": "E",
        "title": "Struggling Artist",
        "description": "You're at the bottom. A poet, novelist, pamphleteer bleeding your soul onto pages for a handful of people who get it. Your power isn't influence - it's impact. You might change one person's life who reads your work in a dimly lit room and feels less alone. It won't pay rent, but sometimes that's enough."
      }
    ]
  },
  "The Legal System": {
    "description": "You think the Law is about justice? Kid, that's adorable. In Sidonia, the law is about contracts, and contracts are about loopholes. Justice is just a commodity, and these are the merchants who sell it by the hour.",
    "skillSpecializationOptions": [
      "Academics: Criminal Law",
      "Social: Debate",
      "Bureaucracy: Contract Law"
    ],
    "resourceSynergyExamples": [
      "Contact: Judicial Contacts",
      "License: Law License",
      "Property: Legal Library Access",
      "License: Court Credentials"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Judge",
        "description": "At the top of the food chain, you've got the city Judges. They're politically appointed, which is a nice way of saying they were bought and paid for long before they ever put on the robes. Their job isn't to find the truth; it's to sign off on whatever deal was already made in a back room somewhere. They don't wield power; they're a symbol of someone else's."
      },
      {
        "priority": "B",
        "title": "Arbitrator",
        "description": "When talking fails, you go to an Arbitrator. This is where the decisions get real. They're a private judge, a hired gun with a gavel. They listen to both sides, and then they lay down the law. Their decision is binding. More often than not, they're just deciding which powerful patron they're more afraid of upsetting."
      },
      {
        "priority": "C",
        "title": "Mediator",
        "description": "This is the first stop for most disputes. A Mediator is a professional peacemaker, a neutral third party who tries to get two people to stop arguing long enough to sign a piece of paper so they can avoid the real courts. It's a noble idea, which is why it so rarely works."
      },
      {
        "priority": "D",
        "title": "Assessor",
        "description": "When a crime happens, the first question isn't 'who did it?' It's 'how much is it worth?' That's where these ghouls come in. The Damage Assessors are accountants with a morbid streak, putting a price tag on everything from a broken window to a broken life. The Arcane Assessors? They're the weird ones who have to figure out the property value of a curse or how much a rogue fire spell costs in damages. They're the city's official bean counters for human misery."
      },
      {
        "priority": "E",
        "title": "Contract Lawyer",
        "description": "This is where it all begins. Every deal, every promise, every threat in this city is written down on paper somewhere, and these are the guys who write it. They're masters of the fine print, the little clauses that can make you a king or leave you with nothing. They're the architects of the chains that bind this city together."
      }
    ]
  },
  "The Private Detective": {
    "description": "You're a professional searcher in a city that hates the light. Your power isn't a badge; it's the stubborn refusal to let a secret stay buried.",
    "skillSpecializationOptions": [
      "Alertness: Investigation",
      "Social: Interrogation",
      "Academics: Criminal Law"
    ],
    "resourceSynergyExamples": [
      "Contact: Police Captain",
      "Contact: Informants",
      "License: Detective License",
      "Property: Detective Office",
      "Equipment: Investigation Equipment"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Master Sleuth",
        "description": "You're not just a PI; you're a legend. You work the high-stakes cases that the White Wardens can't touch and the cops won't. When a Syndicate boss's daughter goes missing or a Sorcerer's ritual goes wrong, they don't call the authorities. They call you. Your fee is astronomical, and your enemies are city-wide."
      },
      {
        "priority": "B",
        "title": "Established Detective",
        "description": "You've built a solid reputation over years of successful cases. The well-off and powerful know your name, and you can command premium fees. You have reliable contacts, a proper office, and the kind of track record that makes clients trust you with sensitive work. You're not the legend they call for the impossible - but you're the proven professional they call when they need results and can afford quality."
      },
      {
        "priority": "C",
        "title": "Private Investigator",
        "description": "This is the classic gumshoe. You work out of a dusty office in a forgotten ward, taking cases the cops have already closed. Cheating spouses, missing persons, blackmail. You know the alleys, you know the informants, and you know how to take a punch. It's a thankless job, but it's a living. Barely."
      },
      {
        "priority": "D",
        "title": "Licensed Investigator",
        "description": "You just got your credentials. Maybe you worked as a police consultant or apprenticed under an established PI. You've got the license and the training, but you're still building your client base and reputation. You're competent enough that people trust you with small cases, but you're not the first call when something serious goes down."
      },
      {
        "priority": "E",
        "title": "Inquirer",
        "description": "You're just starting out. Maybe you're a washed-up cop, a disgraced journalist, or just someone with a knack for asking the wrong questions. You have no office, no reputation, and no fancy clients. You work out of diners and back booths, chasing small-time mysteries for chump change, hoping to catch the one case that will make your name."
      }
    ]
  },
  "The Femme Fatale": {
    "description": "It's not about seduction; it's about savvy. Everyone sees a pretty face and makes assumptions. You've learned that those assumptions are the best weapon you'll ever have.",
    "skillSpecializationOptions": [
      "Social: Persuasion",
      "Social: Deception",
      "Academics: Appraisal"
    ],
    "resourceSynergyExamples": [
      "Contact: High-Society Contacts",
      "Property: False Identities",
      "Property: Fashionable Properties",
      "Equipment: Concealed Weapons"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "The Mastermind",
        "description": "You move in the highest circles of power, a welcome guest at every gala and every backroom deal. You don't just manipulate individuals; you play corporations, political factions, and entire districts against each other for your own gain. You are consistently underestimated, and that's how you win."
      },
      {
        "priority": "B",
        "title": "The Courtesan",
        "description": "You operate independently at the upper levels of Sidonian society. Corporate executives, Ward Bosses, and old money families know your name. You're invited to the right parties, trusted with sensitive negotiations, and paid handsomely to be the charming face that smooths over ugly deals. You're not pulling the strings yet - but you're in the room when they're being pulled."
      },
      {
        "priority": "C",
        "title": "The Honey-Pot",
        "description": "You're a professional operator. You work for a spy ring, a corporation, or a powerful Banu, using your charm and wit as a weapon. Your job is to get close, to learn secrets, and to exploit weaknesses. You're a ghost in the social scene, a beautiful face with a dangerous agenda."
      },
      {
        "priority": "D",
        "title": "The Social Climber",
        "description": "You've caught the attention of someone with power - maybe a Banu's lieutenant, a corporate handler, or a Ward Boss's fixer. You're being groomed, tested, given small jobs to prove yourself. You're no longer just surviving; you're learning the game from the inside. You've got potential, and dangerous people are starting to notice."
      },
      {
        "priority": "E",
        "title": "The Survivor",
        "description": "You're no one's pawn. You've learned from the ground up that your appearance is a shield. On the streets, people either dismiss you, desire you, or ignore you—and you've learned to use every one of those reactions to survive. You play the part people expect, long enough to get what you need and disappear before they know what hit them."
      }
    ]
  },
  "Old Blood": {
    "description": "Your family name is older than the Republic. It's a key, a weapon, and a cage, all in one.",
    "skillSpecializationOptions": [
      "Academics: History",
      "Social: Etiquette",
      "Bureaucracy: Graft"
    ],
    "resourceSynergyExamples": [
      "Contact: Family Connections",
      "Income: Trust Funds",
      "Property: Central Ward Properties",
      "License: Prestigious Licenses"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "The Inheritor",
        "description": "Your last name is a skeleton key that opens doors no one else even knows exist. It gets your calls returned by Judges and your invitations accepted by Icons. You may not control the family fortune directly, but you are the living legacy of its power, and the city never lets you forget it."
      },
      {
        "priority": "B",
        "title": "The Scion",
        "description": "You're a recognized member of the family with real standing. Not the heir, but close enough that you handle important family business. When you speak, people assume you speak with family authority. You attend the important meetings, you're trusted with sensitive negotiations, and your success or failure reflects on the whole bloodline. You're not at the top yet, but you're being groomed for it."
      },
      {
        "priority": "C",
        "title": "The Black Sheep",
        "description": "You have the name, but not the favor. Maybe you're a disappointment, a rebel, or from a lesser branch of the family. The name still opens doors, but it also comes with heavy expectations and the constant scrutiny of your relatives. You have access to power, but you are not trusted with it."
      },
      {
        "priority": "D",
        "title": "The Cousin",
        "description": "You're legitimate family, but distant enough that nobody expects much. Maybe you're from a cadet branch, or the child of a spare heir. You're invited to family functions, you can drop the name to get meetings, and people treat you with cautious respect - but everyone knows you're not in line for real power. You're learning the family business from the edges, hoping to prove yourself useful enough to matter."
      },
      {
        "priority": "E",
        "title": "The Outcast",
        "description": "Your parents were cast out, disowned. You grew up on stories of a power and prestige you've never known. Your name means nothing to those in the know, but to the uninformed, it can still work a little magic, opening a minor door here or there. But it's a dangerous game—if your bluff is called, the consequences will be severe. Still, you inherited some of the family's know-how, a whisper of the way things 'really work'."
      }
    ]
  },
  "The Info Broker": {
    "description": "You're a merchant, but your product is secrets. You're a vital part of the city's ecosystem—which is a polite way of saying you're a target for everyone.",
    "skillSpecializationOptions": [
      "Social: Barter",
      "Academics: Appraisal",
      "Alertness: Perception"
    ],
    "resourceSynergyExamples": [
      "Contact: Diverse Contacts",
      "Equipment: Surveillance Equipment",
      "Property: Secure Meeting Spaces",
      "Equipment: Encrypted Communications"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Spymaster",
        "description": "You don't just sell secrets; you control their flow. You run a major network like the Crimson Exchange, with agents in every corner of the city. The information you trade can start wars, topple corporations, or change the political landscape overnight. You are one of the true, hidden powers of Sidonia."
      },
      {
        "priority": "B",
        "title": "The Intelligence Merchant",
        "description": "You run a professional operation. Multiple agents feed you information, you maintain networks across several Wards or sectors, and you broker deals between major players. Corporations, Ward Bosses, and Syndicate leaders know your name. The secrets you trade can shift power balances and end careers. You're not the shadow master yet, but you're one of the people they come to when they need to know something important."
      },
      {
        "priority": "C",
        "title": "The Broker",
        "description": "You're a significant player in a specific market. Maybe you handle all the corporate espionage in the Central Ward, or you're the trusted source for the Under-Kin's smuggling operations. You have a reputation, a network of reliable sources, and a long list of dangerous clients who both need and fear you."
      },
      {
        "priority": "D",
        "title": "The Stringer",
        "description": "You're a working information dealer with steady business. You've got a handful of reliable sources, a reputation for accuracy in your niche, and regular clients who come back. Maybe you specialize in corporate gossip, Ward politics, or underworld movements. You're not playing at the big tables yet, but you're making a living and building the network that'll get you there."
      },
      {
        "priority": "E",
        "title": "The Rumormonger",
        "description": "You're a street-level hub of information. You don't have a network of agents; you have a barstool and a good ear. You trade in gossip, whispers, and the kind of low-level dirt that can be surprisingly valuable to the right person. You're the first person people ask when they want to know what's really going on in the neighborhood."
      }
    ]
  },
  "The Driver & The Transporter": {
    "description": "Most people in this city will live and die without owning a car. That makes you essential. You're a ghost in the traffic, an escape artist, the master of the city's arteries.",
    "skillSpecializationOptions": [
      "Operator: Drive Auto",
      "Ranged: Handguns",
      "Engineering: Mechanics"
    ],
    "resourceSynergyExamples": [
      "Equipment: Vehicle",
      "License: Travel Permits",
      "Property: Garage Space",
      "Equipment: Mechanical Tools"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "The Wheelman",
        "description": "You're a legend. When someone needs to move something or someone through impossible situations, your name comes up first. You've driven through gang wars, outrun White Wardens, and navigated routes that shouldn't exist. Your vehicle is custom-built to your specifications, your reflexes are superhuman, and your fee reflects the fact that if you take the job, it will get done. You're not just a driver - you're an artist, and the city's streets are your canvas."
      },
      {
        "priority": "B",
        "title": "The Transporter",
        "description": "You don't just drive; you deliver. You offer secure, high-speed transportation for high-value cargo, be it a person, a package, or something less legal. You're a driver, a bodyguard, and a mechanic rolled into one. Your vehicle is a fortress, your routes are secrets, and your reputation for success is flawless."
      },
      {
        "priority": "C",
        "title": "The Owner-Operator",
        "description": "You own your vehicle outright and run your own business. Maybe it's a legitimate taxi service with regular routes and steady clients, or maybe you're the go-to driver for mid-level criminals who need discretion. You've got your garage, your license, and a reputation for reliability. You're not legendary, but you're independent and professional."
      },
      {
        "priority": "D",
        "title": "The Driver",
        "description": "You're the talent behind the wheel. You might be the trusted chauffeur for a corporate exec, the getaway driver for a local Banu's crew, or you run a private taxi for clients who need discretion. You know the city's streets better than anyone, but the car isn't yours, and you don't get paid to ask questions. Your job is to drive, nothing more."
      },
      {
        "priority": "E",
        "title": "The Courier",
        "description": "You're just starting out. Maybe you run messages on foot or bicycle, or you borrow someone's car for occasional jobs. You know how to navigate the city and you're fast, but you don't have your own wheels yet and you're still proving you can be trusted with the important runs. You're building your reputation one delivery at a time."
      }
    ]
  },
  "The Cop": {
    "description": "You are the law—or at least, you wear the badge. Whether you're a jaded detective or a beat cop trying to keep the peace, you walk a fine line between order and the abyss.",
    "skillSpecializationOptions": [
      "Melee: Baton",
      "Bureaucracy: Law",
      "Alertness: Investigation"
    ],
    "resourceSynergyExamples": [
      "Contact: Police Contacts",
      "Equipment: Official Weapons",
      "License: Badge and Credentials",
      "Equipment: Patrol Vehicle"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Police Captain",
        "description": "You run a precinct or major division. You don't patrol streets anymore - you command those who do. You have a desk, political connections, and the weight to make problems disappear or create them. When a case gets too hot, too weird, or too politically sensitive, it lands on your desk and you decide who handles it and how. You answer to the Ward Boss and the Ministry, which means you're always walking a tightrope."
      },
      {
        "priority": "B",
        "title": "Detective",
        "description": "You're plainclothes, working major cases. You have more autonomy than beat cops but also more pressure. When violence goes supernatural or politically complicated, you're expected to close it quietly. You've got a partner, a desk, and access to resources that street cops don't - but you're also the one who gets blamed when things go wrong."
      },
      {
        "priority": "C",
        "title": "Sergeant",
        "description": "You're the bridge between command and the street. You lead a squad of beat cops, handle the day-to-day operations in your sector, and make the calls when situations escalate. The rookies look to you for guidance, the brass expects you to keep things running smooth, and you're the one who takes the heat when your Ward goes sideways."
      },
      {
        "priority": "D",
        "title": "Beat Cop",
        "description": "You walk a beat, know the locals, and respond to the daily chaos. You're the first on scene and the face of law in your Ward. It's thankless work - the criminals hate you, the citizens don't trust you, and your superiors barely acknowledge you exist unless you screw up."
      },
      {
        "priority": "E",
        "title": "Liaison",
        "description": "You're the bottom rung. Maybe you're a clerk who processes paperwork, a records officer who files reports, or a community liaison who attends Ward meetings. You wear the uniform but you're not a real cop in anyone's eyes - especially your own. You see the cases, you hear the stories, but you're kept safely away from the actual danger."
      }
    ]
  },
  "The Syndicate Member": {
    "description": "You're part of a family—the kind that settles disputes with violence and funds itself through illicit enterprise. You have a place, you have a purpose, and you are protected, so long as you remain loyal.",
    "skillSpecializationOptions": [
      "Hand-to-Hand: Brawler",
      "Social: Intimidation",
      "Larceny: Security"
    ],
    "resourceSynergyExamples": [
      "Equipment: Brass Knuckles",
      "Contact: Syndicate Member",
      "Property: Safe House"
    ],
    "professions": [
      {
        "priority": "B",
        "title": "Lieutenant",
        "description": "You're a made man, an officer in your organization. You run a crew, manage a territory, or oversee a specific racket. You have the authority to give orders and the responsibility to produce results. Your name carries weight in the underworld. When you speak, people listen—or they learn to."
      },
      {
        "priority": "D",
        "title": "Enforcer",
        "description": "You're the muscle. A street soldier. When your boss needs a message delivered, a debt collected, or a rival intimidated, they send you. You're valued for your loyalty and your capacity for violence. It's not a glamorous life, but it's a living, and it comes with the respect that fear commands."
      }
    ]
  },
  "The Medic": {
    "description": "In a city this sick, someone has to patch up the wounded. You're a healer, though your methods and clientele may vary wildly.",
    "skillSpecializationOptions": [
      "Medicine: Triage",
      "Social: Empathy",
      "Alertness: Assessment"
    ],
    "resourceSynergyExamples": [
      "Equipment: Medical Equipment",
      "Property: Clinic Space",
      "Contact: Pharmaceutical Contacts",
      "License: Medical License"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Chief of Surgery",
        "description": "You run a medical department at a major hospital or head a prestigious private practice. Your skills are legendary, your patient list includes Ward Bosses and corporate executives, and you have access to the best equipment and facilities in Sidonia. When someone important is dying, you're the one they call. Your recommendations can make or break medical careers."
      },
      {
        "priority": "B",
        "title": "Licensed Surgeon",
        "description": "You're a professional, working out of a legitimate clinic or corporate hospital. You have access to clean rooms, advanced medical technology, and a license that protects you. You serve the city's elite, patching up the wealthy and well-connected. The pay is good, but you're often complicit in the secrets your patients carry."
      },
      {
        "priority": "C",
        "title": "General Practitioner",
        "description": "You run a small legitimate practice in a Mid or Upper Ward. You handle everyday medicine - setting bones, treating infections, delivering babies. You're licensed, respected in your community, and you make an honest living keeping ordinary people alive. The work is steady, the hours are brutal, and the pay is modest."
      },
      {
        "priority": "D",
        "title": "Street Doc",
        "description": "You're an unlicensed practitioner working in the shadows. Your clinic is a back room, your tools are second-hand, and your patients are gangers, smugglers, and others who can't risk a hospital visit. You're a master of improvisation, and your work is always in demand. You save lives, no questions asked, for a price."
      },
      {
        "priority": "E",
        "title": "Field Medic / Apprentice",
        "description": "You've got basic training - maybe as a Red Sentinel medic, maybe from apprenticing with a street doc, maybe just from patching up enough people to learn what works. You can handle trauma, stop bleeding, and keep someone alive long enough to reach real help. You're not a doctor, but in the Downside, you're close enough."
      }
    ]
  },
  "The Occultist": {
    "description": "You've peered behind the curtain of reality and seen the things that lurk there. This knowledge has marked you, granting you insight and drawing you into a world of secrets, symbols, and sacrifice.",
    "skillSpecializationOptions": [
      "Academics: Occult",
      "Alertness: Investigation",
      "Languages: Old Tongue"
    ],
    "resourceSynergyExamples": [
      "Equipment: Esoteric Texts",
      "Equipment: Occult Artifacts",
      "Contact: Secret Society Contacts",
      "Property: Ritual Spaces"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Adept",
        "description": "You are an initiate of a genuine esoteric order. You don't just read the books; you practice the rites. You understand the true, deep patterns of the universe and can manipulate them. This gives you access to a frightening power, but it also makes you a player in a very old, very dangerous game."
      },
      {
        "priority": "B",
        "title": "Independent Practitioner",
        "description": "You've moved beyond theory into practice, but you work alone or with a small circle of fellow practitioners. You know the rituals, you've performed them successfully, and you understand the risks. You're not part of an established order, which means less support but also less obligation. The spirits and entities you deal with recognize you as legitimate, which is both useful and dangerous."
      },
      {
        "priority": "C",
        "title": "Scholar",
        "description": "You're a serious, dedicated researcher of the forbidden and the arcane. You have a vast library of esoteric texts and a deep theoretical understanding of the occult. You know the rituals, the histories, and the names of power, but you lack the direct initiation of an Adept. You're a master of the theory, but a novice in the practice."
      },
      {
        "priority": "D",
        "title": "Collector",
        "description": "You've assembled a respectable collection of occult knowledge and artifacts. You know enough to identify genuine articles from fakes, understand the significance of symbols, and recognize when something supernatural is happening. You've attempted a few minor workings with mixed results. You're past amateur hour, but you're not ready for the deep end."
      },
      {
        "priority": "E",
        "title": "Dabbler",
        "description": "You found a strange book, you started asking questions, and you got in over your head. You've learned just enough to be dangerous, mostly to yourself. You know a few minor rituals and a handful of secrets, but your curiosity far outstrips your wisdom. The unseen world sees you as a noisy child, which can be amusing for them and fatal for you."
      }
    ]
  },
  "The Journalist": {
    "description": "Everyone has a story, and you're here to tell it. You're a truth-seeker, a muckraker, and a storyteller, chasing down leads in a city built on lies.",
    "skillSpecializationOptions": [
      "Social: Interrogation",
      "Academics: Research",
      "Bureaucracy: Graft"
    ],
    "resourceSynergyExamples": [
      "License: Press Credentials",
      "Contact: Information Contacts",
      "Equipment: Communication Equipment",
      "License: Travel Permits"
    ],
    "professions": [
      {
        "priority": "A",
        "title": "Editor-in-Chief",
        "description": "You run a major news outlet. You decide what stories get told and how they're told. Your editorial decisions can topple Ward Bosses, shift public opinion, and set the city's agenda. You have resources, reach, and political protection - but you're also a target for everyone whose secrets you threaten to expose."
      },
      {
        "priority": "B",
        "title": "Star Reporter",
        "description": "You work for one of the city's major news outlets, like the Sidonia Chronicle or Channel 8 News. Your name is on the front page. You have a press pass that gets you past police lines and a network of high-level sources. When you expose a scandal, the city listens. This makes you a powerful friend and a terrifying enemy."
      },
      {
        "priority": "C",
        "title": "Beat Reporter",
        "description": "You work for a legitimate newspaper or radio station, covering a specific Ward or beat. You know your territory, you have regular sources, and your byline appears consistently. You're not famous, but you're a working journalist with institutional backing and a steady paycheck. The stories you break might not shake the city, but they matter to the people in your Ward."
      },
      {
        "priority": "D",
        "title": "Freelance Stringer",
        "description": "You're an independent operator, a hustler with a camera and a notepad. You chase down stories the big outlets won't touch, then sell your findings to the highest bidder. You work on your own terms, but you have no institutional protection. You live and die by the quality of your leads and the strength of your nerve."
      },
      {
        "priority": "E",
        "title": "Pamphleteer / Blogger",
        "description": "You're not a real journalist in anyone's eyes - you're someone with opinions and access to a printing press or a radio transmitter. You write underground newsletters, distribute pamphlets, or run a pirate radio show. Your reach is tiny, your resources are nonexistent, but you're telling stories nobody else will. The authorities dismiss you as a nuisance, which is the only reason you're still alive."
      }
    ]
  }
}
